// ====================================================================================
// Модуль отображения графических данных через сдвиговый регистр + светодиоды 5х7
// ====================================================================================

#ifndef LEDGRAPH_H
#define LEDGRAPH_H

#define SHREG_FAST

//#include "74HC595fast.h"

// ====================================================================================
// C O N S T A N T S
// ====================================================================================

// max количество лед блоков
#define LEDGRAPH_MAX_LED_NUM 10
// max количество колонок в лед блоке
#define LEDGRAPH_MAX_LED_COL_NUM 5

// ====================================================================================
// P R O C E D U R E S
// ====================================================================================

// -------------------------------------------
// Инициализирует видео память x * y элементов
// если памяти достаточно, возвращает 1 иначе 0
// -------------------------------------------
#ifdef SHREG_FAST  
 char LEDGRAPH_Init(char xx, char yy);
#else	
 char LEDGRAPH_Init(TSHREG_PARAMS * shpar, char xx, char yy);
#endif

// --------------------------------
// Пищет в видеопамять символ C в позицию X, Y (считается от 0)
// RETURN: 0 - ошибка, 1 - удачно
// --------------------------------
char LEDGRAPH_Print_char(char x, char y, char c);

// ------------------------------------------------------------
// Пищет в видеопамять графическое представление символа C в позицию X, Y (считается от 0)
// со скроллом (указывается с какого столбца рисовать)
// RETURN: 0 - ошибка, 1 - удачно
// ------------------------------------------------------------
char LEDGRAPH_Print_char_scroll(char x, char y, char c, signed char firstcol);

// -----------------------------------------------------------
// Копирует в видеопамять картинку из массива
// -----------------------------------------------------------
void LEDGRAPH_Put_image(char * img);


char LEDGRAPH_Print_str_scroll(char x, char y, char * s, signed char firstcol);

// --------------------------------
// Пищет в видеопамять AsciiZ строку символов s в позицию X, y
// RETURN: количество реально напечатанных символов
// --------------------------------
char LEDGRAPH_Print_str(char x, char y, char * s);

// -----------------------------------------------------------
// Пищет в видеопамять Ascii строку символов s в позицию X, Y длиной len
// RETURN: количество реально напечатанных символов
// -----------------------------------------------------------
char LEDGRAPH_Print_str_len(char x, char y, char * s, char len);

// -------------------------------------------------------------
// Обновляет экран (необходимо вызывать периодически по таймеру!)
// -------------------------------------------------------------
void LEDGRAPH_Refresh(void);

// --------------------------------------------------------------
// Рисует черный экран
// --------------------------------------------------------------
void LEDGRAPH_CLRSCR(void);

#endif