#ifndef _ATADC_H
#define _ATADC_H


// ===================================
// P R O C E D U R E S
// ===================================

// --------------------------------------------
// Переводит данные из одного формата в другой 
// (линейнозависимый)
// --------------------------------------------
//int ADC_GetRecalc(unsigned int adcval1, int calval1, unsigned int adcval2, int calval2);

// -----------------------------------
// Возвращает текущее значение АЦП
// -----------------------------------
unsigned int ATADC_GetValue(void);

// -----------------------------------
// ADC initialize
// -----------------------------------
void ATADC_Init(char channel);

/*Функция остановки измерения АЦП*/
void
ATADC_Stop(void);

/*Функуция запуска измерения АЦП*/
void 
ATADC_Start(void);

#endif

