// *********************************
// Драйвер ШИМ генератора
// Atmega162 / 128
// *********************************
// 16.03.2007 * Выдача сигналов в два заданных пина
// *********************************
// 25.04.2007
// * Поддержка atmega128
// * Передача параметров через ссылку
// *********************************
// 20.06.2008 *Передача параметров в обычном формате 'REG', PIN
// *********************************
//**********************************
//20.04.2009 + Функция динамического изменения коэффициента заполнения
//***********************************

#ifndef _PWM_H
#define _PWM_H


// ===============================================================================
// STRUCTURES
// ===============================================================================


// ===============================================================================
// FUNCTIONS
// ===============================================================================

// ----------------------
// Запуск ШИМ модулятора
// ----------------------
// high/low divider ( % соотношение длительности высокого;уровня к длительности низкого)
// в reg:pin выдаются импульсы
void PWM_Start(char reg, char pin, unsigned char hldiv);

// ----------------------
// Останов ШИМ модулятора
// ----------------------
void PWM_Stop(void);

/**
*   Функция динамического изменения  high/low divider 
*   ( % соотношение длительности высокого уровня к длительности низкого)
*/
void 
PWM_Set_Div(char reg, char pin,char hldiv);


#endif

